print()
'''
또 다른 반복문 : while문
while <조건문> :
    <수행문장1>
    <문장2>
    .
    .
while문은 조건이 참이면 while문 코드 블록을 반복 실행한다
무한 루프에 빠지지 않게 하려면 참인 조건문을 끝나게 해야한다
'''

print('-------------------------------------------')
# 9단 출력
i = 1
while i <= 9:
    print(9 * i)
    i += 1

# while 문은 for문 보다 조건을 더 정확하게 써야 함. 그러므로 코드가 더 복잡
# 상황에 맞는 반복문을 선택하면 됨

print('-------------------------------------------')
# while문도 중첩이 가능. 구구단 9단까지 모두 출력





























